DataProcessors/ЗагрузкаНоменклатурыИзExcel.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаНоменклатурыИзExcel</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерКолонкиНаименование</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКолонкиЕдИзм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеКЗагрузке</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отметка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеДляПечати</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АльтернативнаяЕдИзм</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазоваяЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АльтернативнаяЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АльтернативнаяЕдИзмКоэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АльтернативнаяЕдИзмВес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНоменклатуры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаНоменклатуры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Documents/ОприходованиеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ОприходованиеТоваров</Name>
			<Comment>Оприходование товаров</Comment>
			<BasedOn>
				<xr:Item>Document.Инвентаризация</xr:Item>
				<xr:Item>Document.ЗаказНаПроизводство</xr:Item>
				<xr:Item>Document.ВыпускПродукции</xr:Item>
				<xr:Item>Document.Монтаж</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыпускПродукции</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДоходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданПриИспользованииПодразделений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДоходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ЕдиницыИзмерений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ЕдиницыИзмерений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ЗагрузкаНоменклатурыИзExcel/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Загрузка(Команда)
	
	Если не ПроверитьЗаполнение() Тогда 
		Возврат;
	КонецЕсли;

	Объект.ДанныеКЗагрузке.Очистить();
	
	// №11471 делаем чтение через табличный документ, чтобы не требовалась установка Excel
	НачатьПомещениеФайла(Новый ОписаниеОповещения("ПослеПомещенияФайлаВоВременноеХранилище", ЭтотОбъект),, ПутьКФайлу, Ложь, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПомещенияФайлаВоВременноеХранилище(Успешно, АдресВХранилище, ВыбранноеИмяФайла, ДопПараметры) Экспорт
	
	Если Не Успешно Тогда
		Возврат;
	КонецЕсли;
	
	ПрочитатьФайлExcel(АдресВХранилище);
	
	ПоказатьОповещениеПользователя ("Чтение файла завершено");
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьФайлExcel(АдресВХранилище)
	
	РасширениеФайла = Сред(ПутьКФайлу, СтрНайти(ПутьКФайлу, ".", НаправлениеПоиска.СКонца)+1);
	ПутьКФайлуНаСервере = ПолучитьИмяВременногоФайла(РасширениеФайла);
	ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(АдресВХранилище);
	ДвоичныеДанныеФайла.Записать(ПутьКФайлуНаСервере);
	
	ТабДокИзФайла = новый ТабличныйДокумент;
	
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		ТабДокИзФайла.Прочитать(ПутьКФайлуНаСервере, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	Исключение
		Сообщить("Не удалось прочитать файл Excel: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
	
	КоличествоСтрок = ТабДокИзФайла.ПолучитьРазмерОбластиДанныхПоВертикали();
	КоличествоКолонок = ТабДокИзФайла.ПолучитьРазмерОбластиДанныхПоГоризонтали();
	
	Для НомерСтроки = НачСтр По КоличествоСтрок Цикл
		Попытка
			Наименование = ЗначениеИзОбласти(ТабДокИзФайла, НомерСтроки, Объект.НомерКолонкиНаименование);
			Если Не Наименование = "" тогда 
				Стр = Объект.ДанныеКЗагрузке.Добавить();
				Стр.Наименование = Наименование;
				Стр.ЕдиницаИзмерения = ЗначениеИзОбласти(ТабДокИзФайла, НомерСтроки, Объект.НомерКолонкиЕдИзм);
				
				//++ №12909
				Если НЕ НомерКолонкиНаименованиеДляПечати = 0 Тогда
					Стр.НаименованиеДляПечати = ЗначениеИзОбласти(ТабДокИзФайла, НомерСтроки, НомерКолонкиНаименованиеДляПечати);
				КонецЕсли;
				//-- №12909				
				
				Если не НомерКолонкиАртикул = 0 Тогда					
					Стр.Артикул = ЗначениеИзОбласти(ТабДокИзФайла, НомерСтроки, НомерКолонкиАртикул);
				КонецЕсли;
				Если не НомерКолонкиХарактеристика = 0 Тогда					
					Стр.Характеристика = ЗначениеИзОбласти(ТабДокИзФайла, НомерСтроки, НомерКолонкиХарактеристика);
				КонецЕсли;
				Если не НомерКолонкиКоличество = 0 Тогда
					Стр.Количество = ЗначениеИзОбласти(ТабДокИзФайла, НомерСтроки, НомерКолонкиКоличество);
				КонецЕсли;	
				Если не НомерКолонкиЦена = 0 Тогда
					Стр.Цена = ЗначениеИзОбласти(ТабДокИзФайла, НомерСтроки, НомерКолонкиЦена);
				КонецЕсли;
				//Вид номенклатуры
				Если ОпределятьВидПоФайлу И не НомерКолонкиВидНоменклатуры = 0 Тогда
					Стр.ВидНоменклатуры = ЗначениеИзОбласти(ТабДокИзФайла, НомерСтроки, НомерКолонкиВидНоменклатуры);
				КонецЕсли;
				//Группа номенклатуры
				Если ОпределятьГруппуПоФайлу И не НомерКолонкиГруппаНоменклатуры = 0 Тогда
					Стр.ГруппаНоменклатуры = ЗначениеИзОбласти(ТабДокИзФайла, НомерСтроки, НомерКолонкиГруппаНоменклатуры);
				КонецЕсли;
				//Альтернативная ед. изм.
				Если НЕ НомерКолонкиАльтернативнаяЕдИзм = 0 Тогда
					Стр.АльтернативнаяЕдИзм = ЗначениеИзОбласти(ТабДокИзФайла, НомерСтроки, НомерКолонкиАльтернативнаяЕдИзм);
				КонецЕсли;
				Если НЕ НомерКолонкиКоэффициентАльтЕдИзм = 0 Тогда
					Стр.АльтернативнаяЕдИзмКоэффициент = ЗначениеИзОбласти(ТабДокИзФайла, НомерСтроки, НомерКолонкиКоэффициентАльтЕдИзм);
				КонецЕсли;
				Если НЕ НомерКолонкиВесАльтЕдИзм = 0 Тогда
					Стр.АльтернативнаяЕдИзмВес = ЗначениеИзОбласти(ТабДокИзФайла, НомерСтроки, НомерКолонкиВесАльтЕдИзм);
				КонецЕсли;
			конецесли;
		Исключение
			Сообщить("Ошибка чтения строки файла." + НомерСтроки + Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Внимание);
		КонецПопытки;
	КонецЦикла;
		
	ОпределитьНоменклатуру(Истина);
	
КонецПроцедуры

&НаСервере
Функция ЗначениеИзОбласти(ТабДокИзФайла, НомерСтроки, НомерКолонки)
	
	Возврат СокрЛП(ТабДокИзФайла.Область("R" + Формат(НомерСтроки, "ЧГ=") +"C" + Формат(НомерКолонки, "ЧГ=")).Текст);
	
КонецФункции

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр =  "Файлы Excel|*.xls;*.xlsx";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл Excel";
	ДиалогОткрытияФайла.Выбрать();
	ПутьКФайлу = ДиалогОткрытияФайла.ПолноеИмяФайла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НачСтр = 1;
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаСервере
Процедура ОпределитьНоменклатуру(ВыводитьСообщения = Ложь)
	
	Для Каждого ТекущаяСтрока Из Объект.ДанныеКЗагрузке Цикл
		
		Если ТекущаяСтрока.Номенклатура.Пустая() Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Номенклатура.Ссылка
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	НЕ Номенклатура.ЭтоГруппа
			|	И Номенклатура.Наименование = &Наименование";
			Запрос.УстановитьПараметр("Наименование",ТекущаяСтрока.Наименование);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				ТекущаяСтрока.Номенклатура = Выборка.Ссылка;
			КонецЦикла;
		КонецЕсли;
		
		// Нужно найти характеристику при наличии
		Если ЗначениеЗаполнено(СокрЛП(ТекущаяСтрока.Характеристика)) И ТекущаяСтрока.ХарактеристикаНоменклатуры.Пустая() И НЕ ТекущаяСтрока.Номенклатура.Пустая() Тогда
			ТекущаяСтрока.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.НайтиПоНаименованию(СокрЛП(ТекущаяСтрока.Характеристика), Истина,, ТекущаяСтрока.Номенклатура);
		КонецЕсли;
		
		ТекущаяСтрока.БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(ТекущаяСтрока.ЕдиницаИзмерения, Истина);
		Если НЕ ТекущаяСтрока.БазоваяЕдиницаИзмерения.Пустая() Тогда
			ТекущаяСтрока.Отметка = Истина;
		ИначеЕсли ВыводитьСообщения Тогда
			Сообщить("В строке №" + ТекущаяСтрока.НомерСтроки + " не удалось определить единицу по классификатору."); // №11471
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.АльтернативнаяЕдИзм) Тогда
			ТекущаяСтрока.АльтернативнаяЕдиницаИзмерения = Справочники.ЕдиницыИзмерений.НайтиПоНаименованию(ТекущаяСтрока.АльтернативнаяЕдИзм, Истина,, ТекущаяСтрока.Номенклатура);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьНоменклатуруНаСервере()
	
	Если НЕ ОпределятьВидПоФайлу И ВидНовойНоменклатуры.Пустая() Тогда
		Сообщить("Не указан вид для создаваемой номенклатуры");
		Возврат;
	КонецЕсли;
	
	Если НЕ ГруппаДляНовойНоменклатуры.Пустая() Тогда
		Если НЕ ГруппаДляНовойНоменклатуры.ЭтоГруппа Тогда
			Сообщить("Группой новой номенклатуры должна быть группа, а не элемент");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из Объект.ДанныеКЗагрузке Цикл
		
		Если НЕ ТекущаяСтрока.Отметка Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекущаяСтрока.БазоваяЕдиницаИзмерения.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекущаяСтрока.Номенклатура.Пустая() Тогда
			//Попробуем найти номенклатуру | могут быть характеристики
			//Вдруг она встречается несколько раз и её не было изначально
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Номенклатура.Ссылка
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	НЕ Номенклатура.ЭтоГруппа
			|	И Номенклатура.Наименование = &Наименование";
			Запрос.УстановитьПараметр("Наименование",ТекущаяСтрока.Наименование);		
			
			Выборка = Запрос.Выполнить().Выбрать();
			НайденнаяНоменклатура = Справочники.Номенклатура.ПустаяСсылка();
			Если Выборка.Количество() > 0 Тогда 
				Выборка.Следующий(); 
				НайденнаяНоменклатура = Выборка.Ссылка;
			КонецЕсли;;	
			
			Если НайденнаяНоменклатура.Пустая() Тогда
				
				НоваяНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();
				НоваяНоменклатура.Заполнить(Неопределено);
				НоваяНоменклатура.Наименование = ТекущаяСтрока.Наименование;
				НоваяНоменклатура.Артикул = ТекущаяСтрока.Артикул;
				
				//++ №12909 если указано подставим, иначе при записи карточки присвоит из наименования
				Если ЗначениеЗаполнено(ТекущаяСтрока.НаименованиеДляПечати) Тогда
					НоваяНоменклатура.НаименованиеДляПечати = ТекущаяСтрока.НаименованиеДляПечати;
				КонецЕсли;
				//-- №12909
				
				//Группа номенклатуры
				Родитель = ГруппаДляНовойНоменклатуры;
				Если ОпределятьГруппуПоФайлу И ЗначениеЗаполнено(ТекущаяСтрока.ГруппаНоменклатуры) Тогда
					ЗапросГруппа = Новый Запрос;
					ЗапросГруппа.Текст = 
					"ВЫБРАТЬ ПЕРВЫЕ 1
					|	Номенклатура.Ссылка
					|ИЗ
					|	Справочник.Номенклатура КАК Номенклатура
					|ГДЕ
					|	Номенклатура.ЭтоГруппа
					|	И Номенклатура.Наименование = &Наименование";
					ЗапросГруппа.УстановитьПараметр("Наименование", ТекущаяСтрока.ГруппаНоменклатуры);		
					
					ВыборкаГруппа = ЗапросГруппа.Выполнить().Выбрать();
					Если ВыборкаГруппа.Следующий() Тогда
						Родитель = ВыборкаГруппа.Ссылка;
					КонецЕсли;
				КонецЕсли;
				НоваяНоменклатура.Родитель = Родитель;		
				
				//Вид номенклатуры
				ВидНоменклатуры = ВидНовойНоменклатуры;				
				Если ОпределятьВидПоФайлу Тогда
					
					НайденныйВид = Справочники.ВидыНоменклатуры.ПустаяСсылка();
					
					Если ЗначениеЗаполнено(ТекущаяСтрока.ВидНоменклатуры) Тогда
						НайденныйВид = Справочники.ВидыНоменклатуры.НайтиПоНаименованию(ТекущаяСтрока.ВидНоменклатуры, Истина);
					КонецЕсли;
					
					// №11471 если вид номенклатуры не нашли, пропускаем с выводом ошибки
					Если НайденныйВид.Пустая() Тогда
						Сообщить("В строке №" + ТекущаяСтрока.НомерСтроки + " не удалось определить вид номенклатуры по указанному наименованию " + ТекущаяСтрока.ВидНоменклатуры + ", строка пропущена.");
						Продолжить;
					Иначе
						ВидНоменклатуры = НайденныйВид;
					КонецЕсли;	
					
				КонецЕсли;
				
				НоваяНоменклатура.ВидНоменклатуры = ВидНоменклатуры;
				
				//Базовая ед. изм.
				//НоваяНоменклатура.БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(ТекущаяСтрока.ЕдиницаИзмерения, Истина);
				НоваяНоменклатура.БазоваяЕдиницаИзмерения = ТекущаяСтрока.БазоваяЕдиницаИзмерения;
				
				НоваяНоменклатура.Записать();				
				//Если НоваяНоменклатура.БазоваяЕдиницаИзмерения.Пустая() Тогда
				//	НоваяЕдиница = Справочники.КлассификаторЕдиницИзмерения.СоздатьЭлемент();
				//	НоваяЕдиница.Наименование = ТекущаяСтрока.ЕдиницаИзмерения;
				//	НоваяЕдиница.Записать();
				//	
				//	НоваяНоменклатура.БазоваяЕдиницаИзмерения = НоваяЕдиница.Ссылка;
				//	НоваяНоменклатура.Записать();
				//КонецЕсли;
				
				НоваяНоменклатура.АльтернативнаяЕдиницаИзмерения = Справочники.ЕдиницыИзмерений.НайтиПоНаименованию(ТекущаяСтрока.АльтернативнаяЕдИзм, Истина,, НоваяНоменклатура.Ссылка);
				//Альтернативная ед. изм.
				Если ЗначениеЗаполнено(ТекущаяСтрока.АльтернативнаяЕдИзм) И ТекущаяСтрока.АльтернативнаяЕдиницаИзмерения.Пустая() Тогда
					
					НоваяАльтЕдиница = Справочники.ЕдиницыИзмерений.СоздатьЭлемент();
					
					НоваяАльтЕдиница.Наименование = ТекущаяСтрока.АльтернативнаяЕдИзм;
					НоваяАльтЕдиница.Владелец 	  = НоваяНоменклатура.Ссылка;
					НоваяАльтЕдиница.Вес		  = ТекущаяСтрока.АльтернативнаяЕдИзмВес;
					НоваяАльтЕдиница.Коэффициент  = ТекущаяСтрока.АльтернативнаяЕдИзмКоэффициент;
					НоваяАльтЕдиница.Записать();
					
					НоваяНоменклатура.АльтернативнаяЕдиницаИзмерения = НоваяАльтЕдиница.Ссылка;
					НоваяНоменклатура.Записать();
					
				КонецЕсли;
				
				ТекущаяСтрока.Номенклатура = НоваяНоменклатура.Ссылка;
				НоваяНоменклатура = НоваяНоменклатура.Ссылка;
			Иначе
				НоваяНоменклатура = НайденнаяНоменклатура.Ссылка;
				ТекущаяСтрока.Номенклатура = НайденнаяНоменклатура.Ссылка;
			КонецЕсли;
		Иначе
			НоваяНоменклатура = ТекущаяСтрока.Номенклатура.Ссылка;
		КонецЕсли;	
		  		
		//Проверим создадим характеристики
		Если ЗначениеЗаполнено(СокрЛП(ТекущаяСтрока.Характеристика)) Тогда
			НайденнаяХарактеристика = Справочники.ХарактеристикиНоменклатуры.НайтиПоНаименованию(СокрЛП(ТекущаяСтрока.Характеристика), Истина,,НоваяНоменклатура.Ссылка);
			Если НайденнаяХарактеристика.Пустая() Тогда
				НоваяХарактеристика = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
				НоваяХарактеристика.Владелец = НоваяНоменклатура;
				НоваяХарактеристика.Наименование = СокрЛП(ТекущаяСтрока.Характеристика);
				Попытка
					НоваяХарактеристика.Записать();
				Исключение
					Сообщить("Не удалось создать характеристику " + СокрЛП(ТекущаяСтрока.Характеристика) + " для номенклатуры " + НоваяНоменклатура.Ссылка);
				КонецПопытки;	
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНоменклатуру(Команда)
	
	СоздатьНоменклатуруНаСервере();
	ОпределитьНоменклатуру();
	
	Оповестить("ОбновитьФорму");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОприходованиеТоваров(Команда)
	
	Ссылка = СоздатьОприходованиеТоваровНаСервере();
	
	Если НЕ Ссылка = Неопределено Тогда
		
		ПараметрыДокумента = Новый Структура;
		ПараметрыДокумента.Вставить("Ключ",Ссылка);
		
		ОткрытьФорму("Документ.ОприходованиеТоваров.ФормаОбъекта",ПараметрыДокумента);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьОприходованиеТоваровНаСервере()
	
	Если Объект.ДанныеКЗагрузке.Количество() = 0 Тогда
		Сообщить("Таблица номенклатуры не заполнена");
		Возврат Неопределено;
	КонецЕсли;
	
	НовыйДокумент = Документы.ОприходованиеТоваров.СоздатьДокумент();
	НовыйДокумент.Дата = ТекущаяДатаСеанса();
	НовыйДокумент.Комментарий = "#Создан обработкой загрузки номенклатуры " + ТекущаяДатаСеанса();
	ОбщийМодуль.ЗаполнитьШапкуДокумента(НовыйДокумент);
	
	Для Каждого ТекущаяСтрока Из Объект.ДанныеКЗагрузке Цикл
		
		Если НЕ ТекущаяСтрока.Количество = 0 И НЕ ТекущаяСтрока.БазоваяЕдиницаИзмерения.Пустая() И НЕ ТекущаяСтрока.Номенклатура.Пустая() Тогда
			
			НоваяСтрока = НовыйДокумент.Товары.Добавить();
			НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
			НоваяСтрока.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
			НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.БазоваяЕдиницаИзмерения;
			НоваяСтрока.Коэффициент = 1;
			НоваяСтрока.Количество = ТекущаяСтрока.Количество;
			НоваяСтрока.Цена = ТекущаяСтрока.Цена;
			НоваяСтрока.Сумма = НоваяСтрока.Количество * НоваяСтрока.Цена;
			
		КонецЕсли;
		
	КонецЦикла;
	
	НовыйДокумент.Записать();
	
	Возврат НовыйДокумент.Ссылка;
	
КонецФункции

&НаСервере
Функция СкачатьШаблонНаСервере()
	ВременноеИмяФайла = ПолучитьИмяВременногоФайла("xlsx");
	МакетСДанными = ПолучитьОбщийМакет("ШаблонФайлаНоменклатуры");
	МакетСДанными.Записать(ВременноеИмяФайла);
	Возврат ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ВременноеИмяФайла), ЭтаФорма.УникальныйИдентификатор);
КонецФункции

&НаКлиенте
Процедура СкачатьШаблон(Команда)
		
	АдресФайла = СкачатьШаблонНаСервере();
	ВременноеИмя = "Шаблон файла номенклатуры.xlsx";
    ПолучитьФайл(АдресФайла, ВременноеИмя, Истина);
	
КонецПроцедуры

&НаСервере
Функция ДанныеКЗагрузкеЕдиницаИзмеренияПриИзмененииНаСервере(ЕдиницаИзмерения)
	Возврат Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(ЕдиницаИзмерения, Истина);
КонецФункции

&НаКлиенте
Процедура ДанныеКЗагрузкеЕдиницаИзмеренияПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ДанныеКЗагрузке.ТекущиеДанные;
	ТекущаяСтрока.БазоваяЕдиницаизмерения = ДанныеКЗагрузкеЕдиницаИзмеренияПриИзмененииНаСервере(ТекущаяСтрока.ЕдиницаИзмерения);
	
	Если ТекущаяСтрока.БазоваяЕдиницаизмерения.Пустая() Тогда
		ТекущаяСтрока.Отметка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеКЗагрузкеЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗаполнитьСписокВыбор(ДанныеВыбора);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбор(ДанныеВыбора)
	ДанныеВыбора = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлассификаторЕдиницИзмерения.Наименование
		|ИЗ
		|	Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
		|ГДЕ
		|	НЕ КлассификаторЕдиницИзмерения.ПометкаУдаления";
		
	РезультатЗапроса = Запрос.Выполнить();
	ДанныеВыбора.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Наименование"));
КонецПроцедуры

&НаКлиенте
Процедура ОпределятьВидПоФайлуПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементыФормы()
	
	Элементы.НомерКолонкиВидНоменклатуры.Доступность = ОпределятьВидПоФайлу;
	Элементы.НомерКолонкиГруппаНоменклатуры.Доступность = ОпределятьГруппуПоФайлу;
	
	Элементы.ДанныеКЗагрузкеВидНоменклатуры.Видимость = ОпределятьВидПоФайлу; 
	Элементы.ДанныеКЗагрузкеГруппаНоменклатуры.Видимость = ОпределятьГруппуПоФайлу;
	
КонецПроцедуры

&НаКлиенте
Процедура ОпределятьГруппуПоФайлуПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	Для Каждого ТекущаяСтрока Из Объект.ДанныеКЗагрузке Цикл
		Если НЕ ТекущаяСтрока.БазоваяЕдиницаИзмерения.Пустая() Тогда
			ТекущаяСтрока.Отметка = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	Для Каждого ТекущаяСтрока Из Объект.ДанныеКЗагрузке Цикл
		ТекущаяСтрока.Отметка = Ложь;		
	КонецЦикла;
	
КонецПроцедуры
